package frege.run;

public class Kind  {
  public interface U<𝑇, 𝓐>  {
    
  }
  public interface B<𝑇, 𝓐, 𝓑>  {
    
  }
  public interface T<𝑇, 𝓐, 𝓑, 𝓒>  {
    
  }
  public interface Q<𝑇, 𝓐, 𝓑, 𝓒, 𝓓>  {
    
  }
  public interface V<𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔>  {
    
  }
  public interface VI<𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕>  {
    
  }
  public interface VII<𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖>  {
    
  }
  public interface VIII<𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗>  {
    
  }
  public interface IX<𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘>  {
    
  }
  public interface X<𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙>  {
    
  }
  public interface XI<𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚>  {
    
  }
  public interface XII<𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛>  {
    
  }
  public interface XIII<𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜>  {
    
  }
  public interface XIV<𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝>  {
    
  }
  public interface XV<𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞>  {
    
  }
  public interface XVI<𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟>  {
    
  }
  public interface XVII<
    𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠
  >  {
    
  }
  public interface XVIII<
    𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡
  >  {
    
  }
  public interface XIX<
    𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢
  >  {
    
  }
  public interface XX<
    𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣
  >  {
    
  }
  public interface XXI<
    𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤
  >  {
    
  }
  public interface XXII<
    𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤, 𝓥
  >  {
    
  }
  public interface XXIII<
    𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤, 𝓥,
    𝓦
  >  {
    
  }
  public interface XXIV<
    𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤, 𝓥,
    𝓦, 𝓧
  >  {
    
  }
  public interface XXV<
    𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤, 𝓥,
    𝓦, 𝓧, 𝓨
  >  {
    
  }
  public interface XXVI<
    𝑇, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤, 𝓥,
    𝓦, 𝓧, 𝓨, 𝓩
  >  {
    
  }
}
