package frege.run;

public class Kind {
  public interface U<𝐓, 𝓐>  {
    
  }
  public interface B<𝐓, 𝓐, 𝓑>  {
    
  }
  public interface T<𝐓, 𝓐, 𝓑, 𝓒>  {
    
  }
  public interface Q<𝐓, 𝓐, 𝓑, 𝓒, 𝓓>  {
    
  }
  public interface V<𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔>  {
    
  }
  public interface VI<𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕>  {
    
  }
  public interface VII<𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖>  {
    
  }
  public interface VIII<𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗>  {
    
  }
  public interface IX<𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘>  {
    
  }
  public interface X<𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙>  {
    
  }
  public interface XI<𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚>  {
    
  }
  public interface XII<𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛>  {
    
  }
  public interface XIII<𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜>  {
    
  }
  public interface XIV<𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝>  {
    
  }
  public interface XV<𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞>  {
    
  }
  public interface XVI<𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟>  {
    
  }
  public interface XVII<
    𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠
  >  {
    
  }
  public interface XVIII<
    𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡
  >  {
    
  }
  public interface XIX<
    𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢
  >  {
    
  }
  public interface XX<
    𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣
  >  {
    
  }
  public interface XXI<
    𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤
  >  {
    
  }
  public interface XXII<
    𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤, 𝓥
  >  {
    
  }
  public interface XXIII<
    𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤, 𝓥,
    𝓦
  >  {
    
  }
  public interface XXIV<
    𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤, 𝓥,
    𝓦, 𝓧
  >  {
    
  }
  public interface XXV<
    𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤, 𝓥,
    𝓦, 𝓧, 𝓨
  >  {
    
  }
  public interface XXVI<
    𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤, 𝓥,
    𝓦, 𝓧, 𝓨, 𝓩
  >  {
    
  }
  public interface XXVII<
    𝐓, 𝓐, 𝓑, 𝓒, 𝓓, 𝓔, 𝓕, 𝓖, 𝓗, 𝓘, 𝓙, 𝓚, 𝓛, 𝓜, 𝓝, 𝓞, 𝓟, 𝓠, 𝓡, 𝓢, 𝓣, 𝓤, 𝓥,
    𝓦, 𝓧, 𝓨, 𝓩, Ω
  >  {
    
  }
}
